In [3]:
import pandas as pd
data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

In [7]:
employees

   emp_id  event_day  in_time  out_time
0       1 2020-11-28        4        32
1       1 2020-11-28       55       200
2       1 2020-12-03        1        42
3       2 2020-11-28        3        33
4       2 2020-12-09       47        74

In [42]:
function_dictionary = {"in_time": "sum", "out_time":'sum'}

temp = employees.groupby(["event_day", "emp_id"]).aggregate(function_dictionary)

temp["total_time"] = temp["out_time"] - temp["in_time"]
temp.drop(["in_time", "out_time"], axis=1, inplace=True)
temp.reset_index().rename(columns={"event_day": "day"})

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-11-28       2          30
2 2020-12-03       1          41
3 2020-12-09       2          27

To concatenate two tables:

In [ ]:
return pd.concat([df1, df2])

Creating pivot table

In [ ]:
| city         | month    | temperature |
| ------------ | -------- | ----------- |
| Jacksonville | January  | 13          |
| Jacksonville | February | 23          |
| Jacksonville | March    | 38          |
| Jacksonville | April    | 5           |
| Jacksonville | May      | 34          |
| ElPaso       | January  | 20          |
| ElPaso       | February | 6           |
| ElPaso       | March    | 26          |
| ElPaso       | April    | 2           |
| ElPaso       | May      | 43          |

In [ ]:
import pandas as pd

def pivotTable(weather: pd.DataFrame) -> pd.DataFrame:
    return weather.pivot_table(columns="city", index="month", values="temperature")

In [ ]:
df.rename(columns={"old": "new"})

Adding column with the length of other column

In [ ]:
tweets["length"] = tweets["content"].apply(len)

We do not use `len()` function of df rows, instead we use `str.len()`

In [ ]:
invalid_tweets_df = tweets[tweets['content'].str.len() > 15]

God knows what

In [ ]:
def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
    employees["bonus"] = employees["salary"]
    for label, row in employees.iterrows():
        if row.employee_id % 2 != 0 and row["name"].startswith("M") == False:
            employees.at[label, 'bonus'] = row.salary
        else:
           employees.at[label, 'bonus'] = 0

    return employees[["employee_id", "bonus"]].sort_values("employee_id")

<hr>

In [2]:
import pandas as pd
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

In [14]:
new_teacher = teacher.groupby("teacher_id")["subject_id"].nunique()
new_teacher.reset_index().rename(columns={"subject_id": "cnt"})

   teacher_id  count
0           1      2
1           2      4

<hr>

In [15]:
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

In [30]:
new_courses = courses["class"].value_counts().reset_index()
new_courses[new_courses["count"] > 5][["class"]]

  class
0  Math

<hr>

In [31]:
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

In [38]:
new_orders = orders["customer_number"].value_counts().reset_index()
new_orders[new_orders["count"] == new_orders["count"].max()][["customer_number"]]

   customer_number
0                3

<hr>

In [2]:
import pandas as pd

In [3]:
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

In [48]:
new_table = activities.groupby("sell_date")["product"].agg(["nunique", "unique"])
new_table = new_table.rename(columns={"nunique": "num_sold", "unique": "products"})
new_table['products'] = new_table['products'].apply(lambda x: sorted(x))
new_table['products']= new_table['products'].str.join(sep=",")
new_table

            num_sold                      products
sell_date
2020-05-30         3  Basketball,Headphone,T-Shirt
2020-06-01         2                  Bible,Pencil
2020-06-02         1                          Mask

<hr>

In [1]:
import pandas as pd

In [5]:
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

In [7]:
print(daily_sales)

     date_id make_name  lead_id  partner_id
0 2020-12-08    toyota        0           1
1 2020-12-08    toyota        1           0
2 2020-12-08    toyota        1           2
3 2020-12-07    toyota        0           2
4 2020-12-07    toyota        0           1
5 2020-12-08     honda        1           2
6 2020-12-08     honda        2           1
7 2020-12-07     honda        0           1
8 2020-12-07     honda        1           2
9 2020-12-07     honda        2           1

In [10]:
daily_sales.groupby(["date_id", "make_name"])[["lead_id", "partner_id"]].nunique().reset_index()

     date_id make_name  lead_id  partner_id
0 2020-12-07     honda        3           2
1 2020-12-07    toyota        1           2
2 2020-12-08     honda        2           2
3 2020-12-08    toyota        2           3

<hr>

In [1]:
import pandas as pd
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

In [2]:
actor_director

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [11]:
new_table = actor_director.groupby("actor_id")["director_id"].value_counts().reset_index()
new_table[new_table["count"] >= 3][["actor_id", "director_id"]]

   actor_id  director_id
0         1            1